{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"A joke","poemAuthor":"Zekiah","poemContent":{"type":"fragment","styles":[],"children":[{"type":"text","content":"\"It's just a fun game\" "},{"type":"newline","count":1},{"type":"text","content":"Who was I kidding, it was the MOST fun game. "},{"type":"newline","count":2},{"type":"text","content":"She was in medbay- hospital, as my normie-crewmates told me (those noobs didn't even know the right terminology, nothing close to an expert like myself). "},{"type":"newline","count":2},{"type":"text","content":"... "},{"type":"newline","count":2},{"type":"text","content":"They kept saying that I should \"get out of the surgery imediately\", and that it was an \"operation\", but the only operation I saw was catching that imposter, and those knives they were holding - I have no clue what they were doing with them, but it was making them look reeeeeal sussy. "},{"type":"newline","count":2},{"type":"text","content":"... "},{"type":"newline","count":2},{"type":"text","content":"Before I could confront them, some alarms went off - time for another task! She was clearly cheating with that clear tube coming from her mouth, anyway, the ship has O2, we don't need those spacesuits. So I started to connect up some wires at the back, checked the screen, \"Oxygen level low\" it read, so I started to re-arrange them faster. I was pretty proud of myself, as by now I had almost completed my task, but before I could finish, a gang of imposters in blue pulled me back! "},{"type":"newline","count":2},{"type":"text","content":"... "},{"type":"newline","count":2},{"type":"text","content":"I broke free, and by now I had begun jumping around the bed in exhiliration, my arm twitching as my finger flicked outwards to point at blue as I screamed \"IMPOSTER, IMPOSTER SUS! EJECT HIM!\" "},{"type":"newline","count":2},{"type":"text","content":"... "},{"type":"newline","count":2},{"type":"text","content":"From the corner of the room, I heard a long beeping sound, at first I thought it was just another ringing sound to join the voices that already resided within my head, but in my opinion, it was probably just the new soundtrack for the latest update! Hopefully I'm imposter next match!"},{"type":"newline","count":1}]},"pageStyle":"centre","pageBackground":""}