{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"Spiders","poemAuthor":"Zekiah","poemContent":"Sometimes I just wish I were a spider, <br>\nlegs sprawled, against a wall, <br>\nor a small crevice, <br>\na calm place that I could tuck into, when it is cold. <br>\n<br>\nConsumerism would lay dead for me. <br>\nHand crafting a piece of art, so easily blown away by the wind, <br>\nlike some kind of monk, carefully laying out each grain, only for one hand to destroy the other's creation. <br>\nBut I'd have no skill. <br>\nIt would all come naturally, instinctively, like  the mind of an artist, or the adventurism of a calligrapher, who spends days weaving, turning and linking the islands of this oh-so lost world. <br>\nYet i have none of these, now. <br>\n<br>\nImagine a world without time; <br>\nno clocks, no calendars, no dials. <br>\nYet this is how the spiders live, <br>\ntheir only clock; night and day, <br>\ntheir only calendar; the seasons, <br>\nand their only dials, being the ageing, as the years pass on, bringing new spiders onto this earth. <br>\nSpiders are never late, spiders are never early. <br>\nThey live in the moment, waiting for the next one, yet satisfied with what they have right now. <br>\n<br>\nAnd it's amazing, <br>\nhow humans innovate, create. <br>\nYet spiders have no drive to push further, <br>\nno need to go to the extends of space, or venture the depths of the ocean. <br>\nBut for spiders? <br>\nNothing. Ever. Changes. <br>\nAnd is it better that way? <br>\nAs spiders don't need qualifications, certifications, or legislations just to be classed as functioning. <br>\nThey have no need to fit into the jigsaw; of office or labour work, <br>\nled to make decisions in days, weeks, seconds,  <br>\nthat could change the rest of a life. <br>\n<br>\nAnd it's like that beauty of time, <br>\nthe grace of each gold-crusted cog on a clock that turns so intricately, <br>\nthe heavens and our stars, and the round moon that comes full every so often, <br>\nis our greatest antagoniser. <br>\n<br>\nAs we decide on things so crucial so fast, <br>\na wrong one causing so much suffering in the end, <br>\nand a right one causing the same; except just for someone else. <br>\nSince the world was never truly free, it's all binary. <br>\nAnd would one feel any better, knowing that he was free, and the <br>\nreason that he did nothing to change the world in life, lest the  <br>\ngrass that he stepped on, or the webs that he unknowingly <br>\ndestroyed, was not the fault of the world, but was entirely his naïve decisions? <br>\nOr would false hope be greater under a regime without choice; at <br>\nleast knowing that while not contributing alone to humanity, he was <br> \npart of a grand clockwork, pushing his country further for future generations? <br>\n<br>\nIt seems like the world decided that we should all be alone, when <br>\npursuing our dreams, or just trying to make it better for our descendants. <br>\n<br>\nAnd while the 'unfree', democratically enact their power to <br>\ndisagree, and break away from the crowd. <br>\n<br>\nSpiders disagree too. <br>\nAs while millions all descend from the same womb. <br>\nSpiders live alone, apart, and make a difference alone, <br>\ncoating the walls in fresh sets of silk, and invisibly clearing the pests of our lives. <br>\nYet somehow they have no human nature; no feelings of failure when their webs are destroyed, and their legacy blown full. <br>\n<br>\nAnd still, the primitive humans can't shake the feeling that they have failed, unless they cure world hunger, war or some other stupid thing they made. <br>\n<br>\nAnd maybe that's why so many people fear them? <br>\n<br>\nAnd now I wonder; <br>\ndo the spiders even know of the millennia of ancestors that came before them? <br>\nOr the magic of their web. <br>\nOr the wonders of the sublime things that brought them in existence? <br>\nOr are they just living? <br>\n<em>In the moment.</em>\n<br>","pageStyle":"centre-wide","pageBackground":""}