{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"Spiders","poemAuthor":"Zekiah","poemContent":"Sometimes I just wish I were a spider, \u0001legs sprawled, against a wall, \u0001or a small crevice, \u0001a calm place that I could tuck into, when it is cold. \u0001\u0001Consumerism would lay dead for me. \u0001Hand crafting a piece of art, so easily blown away by the wind, \u0001like some kind of monk, carefully laying out each grain, only for one hand to destroy the other's creation. \u0001But I'd have no skill. \u0001It would all come naturally, instinctively, like  the mind of an artist, or the adventurism of a calligrapher, who spends days weaving, turning and linking the islands of this oh-so lost world. \u0001Yet i have none of these, now. \u0001\u0001Imagine a world without time; \u0001no clocks, no calendars, no dials. \u0001Yet this is how the spiders live, \u0001their only clock; night and day, \u0001their only calendar; the seasons, \u0001and their only dials, being the ageing, as the years pass on, bringing new spiders onto this earth. \u0001Spiders are never late, spiders are never early. \u0001They live in the moment, waiting for the next one, yet satisfied with what they have right now. \u0001\u0001And it's amazing, \u0001how humans innovate, create. \u0001Yet spiders have no drive to push further, \u0001no need to go to the extends of space, or venture the depths of the ocean. \u0001But for spiders? \u0001Nothing. Ever. Changes. \u0001And is it better that way? \u0001As spiders don't need qualifications, certifications, or legislations just to be classed as functioning. \u0001They have no need to fit into the jigsaw; of office or labour work, \u0001led to make decisions in days, weeks, seconds,  \u0001that could change the rest of a life. \u0001\u0001And it's like that beauty of time, \u0001the grace of each gold-crusted cog on a clock that turns so intricately, \u0001the heavens and our stars, and the round moon that comes full every so often, \u0001is our greatest antagoniser. \u0001\u0001As we decide on things so crucial so fast, \u0001a wrong one causing so much suffering in the end, \u0001and a right one causing the same; except just for someone else. \u0001Since the world was never truly free, it's all binary. \u0001And would one feel any better, knowing that he was free, and the \u0001reason that he did nothing to change the world in life, lest the  \u0001grass that he stepped on, or the webs that he unknowingly \u0001destroyed, was not the fault of the world, but was entirely his naïve decisions? \u0001Or would false hope be greater under a regime without choice; at \u0001least knowing that while not contributing alone to humanity, he was \u0001 part of a grand clockwork, pushing his country further for future generations? \u0001\u0001It seems like the world decided that we should all be alone, when \u0001pursuing our dreams, or just trying to make it better for our descendants. \u0001\u0001And while the 'unfree', democratically enact their power to \u0001disagree, and break away from the crowd. \u0001\u0001Spiders disagree too. \u0001As while millions all descend from the same womb. \u0001Spiders live alone, apart, and make a difference alone, \u0001coating the walls in fresh sets of silk, and invisibly clearing the pests of our lives. \u0001Yet somehow they have no human nature; no feelings of failure when their webs are destroyed, and their legacy blown full. \u0001\u0001And still, the primitive humans can't shake the feeling that they have failed, unless they cure world hunger, war or some other stupid thing they made. \u0001\u0001And maybe that's why so many people fear them? \u0001\u0001And now I wonder; \u0001do the spiders even know of the millennia of ancestors that came before them? \u0001Or the magic of their web. \u0001Or the wonders of the sublime things that brought them in existence? \u0001Or are they just living? \u0001\u0000\u0005\u0000In the moment.\u0002\u0001","pageStyle":"poem-centre-wide","pageBackground":""}