{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"8:19:59","poemAuthor":"Angelos","poemContent":"I swerve right through each chartered lane \u0001Through where the Met. Police does watch, \u0001It just ticked Acht, \u0001At misty Mill Hill, \u0001At Apex Corner, hat ich ein Fehler gemacht. \u0001\u0001Green to Amber, I entered last. \u0001Or it went red; someone had blundered, \u0001\"Where are you going?\", hat er gesagt, \u0001To the county, here down under! \u0001\u0001Wait a minute… \u0001\u0001\"What colour's dichromate?\" \u0001Have a learning dialogue!\" \u0001It’s kind of like orangeade, \u0001Not green or red. \u0001\u0001therefore, I rightfully crossed. \u0001I aced it in Chemistry, except not really, \u0001It’s 8:10 now! Will I make it? How? \u0001At the traffic lights, I did a wheelie. \u0001\"You stupid idiot!\" Why did you throw, \u0001Potassium dichromate on the bright greenol light? \u0001In amberoic acid, now I row! \u0001\u0001It’s eight fifteen and there’s roadworks ahead! \u0001The fat-clogged sewer, to amend. \u0001Thankfully, it’s greenol, they let me go. \u0001\u0001That’s my last traffic light, erased from my mind, \u0001Yet that treacherous bend and heaping hill, \u0001Second by second, the time does kill. \u0001\u0001Blood will have oxygen, \u0001My VO\u0000\b\u00002\u0002 is maxed. \u0001\"Time is tight!\" \u0001Says Ms Whyte. \u0001\u000120, SLOW DOWN! \u0001Put on your school gown! \u0001To thirty accelerate! Cause Ozy’s at the gate, \u0001For uniform slips to release, does he wait. \u0001\u0001His heart that fed and his hand that mocked, \u0001God knows how many detentions hath he clocked. \u0001Twenty-one, twenty-two, twenty-three, twenty-four? \u0001Perhaps a thousand and a hundred more. \u0001\u0001\"Mr Ozy, please have Mercy!\" \u0001Ten then nine, \u0001Martin thought it fine, \u0001\"But aerobic respiration has its limits!\" says Miss Tran \u0001\"Shut your mouth and move you rat!\" \u0001 Or you'll end up under my tyre, flat! \u0001 \u0001Eight, \u0001Now I’m charging at the gate, \u0001Seven, six, five, \u0001In the car park I dive, \u0001Four and three two, \u0001It’s clear ahead, phew. \u0001One, over the hump, \u0001and it’s done… \u0001\u0001On the 59th second of the 19th minute of the 8th hour of January the eighth, \u0001That’s the last student, who made it through the gate. \u0001\u0001","pageStyle":"poem-centre","pageBackground":""}