{"summary":"","tags":"Poem, Seagulls, Insanity, Violent, Wrath","cWarning":false,"cWarningAdditions":"","poemName":"Stomped","poemAuthor":"Junaid","poemContent":"Wrath level 1. \u0001It all began with an itch. \u0001A dead flicker. An oddball glitch, \u0001It’s like Stain is in my brain, \u0001A half twitch of insanity appalls, \u0001Axeli’s name scratched onto the walls - \u0001No. I ignore. \u0001I told my wrath, my wrath did end. \u0001\u0001Wrath level 2. \u0001Then I see a Lokki, \u0001A white lossenge, amongst its kin, \u0001Like some dull, retarded housemartin has-been. \u0001But I blink \u0001And into a visage of fury I wander - \u0001I see its beak-snapp’d, blood-jack’d, half smack’d body, \u0001And its wings stapled into some shoddy, floppy mockery. \u0001And as a withered, stompable peabody \u0001It drops dead onto the ground. And I swear- \u0001As my foot hovers over his carcass, I’m enveloped in this darkness- \u0001Voices of rocks, voices of Aiti, that yell with harshness \u0001and sharpness that tarnish my catharsis \u0001Regardless. I was angry with my foe, \u0001I told it not. My wrath did grow - \u0001\u0001And now it breeded to Wrath level 7, \u0001I see this light coming from heaven. It’s bright, \u0001A familiar sight, it's almost… \u0001Sublime. A king of kings, \u0001Supreme ruler of the coolest things, \u0001He warned me to end. End the wrath. \u0001\u0001But no. It grew both day and night, \u0001Till it bore an apple bright. \u0001And the Sublime beheld it shine \u0001\u0001For he knew that it was mine- \u0001Wrath level 10, And the twitch commenced again. A dead flicker, \u0001An oddball glitch, it’s like \u0001I’m in a battle with Axel and \u0001Now everything screams, \u0001A siren of the Phrenes, I scream and scream \u0001And all the more my foot twitches, which is \u0001A sign that the stomp is MINE! \u0001MINE, not the Sublime’s, or \u0001some other klein spineless swine in brine’s, \u0001I see the blood stained hue, remains of the lokki’s life \u0001Settle within its eyes. Free of remorse, I laugh. \u0001I laugh, and then \u0001I stomp. \u0001\u0001Blood. Blood everywhere. \u0001Stomp. It’s a crippled bloodbath of wing and beak, \u0001I stomp. It is dead. I laugh. \u0001Stomp. It’s a joke, it’s all a joke! \u0001I stomp. A killing joke. \u0001\u0001I stomp. \u0001\u0001And now I won’t ever stop. \u0001","pageStyle":"centre","pageBackground":""}