{"summary":"","tags":"Poem, Seagulls, Insanity, Violent, Wrath","cWarning":false,"cWarningAdditions":"","poemName":"Stomped","poemAuthor":"Junaid","poemContent":"Wrath level 1. It all began with an itch. A dead flicker. An oddball glitch, It’s like Stain is in my brain, A half twitch of insanity appalls, Axeli’s name scratched onto the walls - No. I ignore. I told my wrath, my wrath did end. Wrath level 2. Then I see a Lokki, A white lossenge, amongst its kin, Like some dull, retarded housemartin has-been. But I blink And into a visage of fury I wander - I see its beak-snapp’d, blood-jack’d, half smack’d body, And its wings stapled into some shoddy, floppy mockery. And as a withered, stompable peabody It drops dead onto the ground. And I swear- As my foot hovers over his carcass, I’m enveloped in this darkness- Voices of rocks, voices of Aiti, that yell with harshness and sharpness that tarnish my catharsis Regardless. I was angry with my foe, I told it not. My wrath did grow - And now it breeded to Wrath level 7, I see this light coming from heaven. It’s bright, A familiar sight, it's almost… Sublime. A king of kings, Supreme ruler of the coolest things, He warned me to end. End the wrath. But no. It grew both day and night, Till it bore an apple bright. And the Sublime beheld it shine For he knew that it was mine- Wrath level 10, And the twitch commenced again. A dead flicker, An oddball glitch, it’s like I’m in a battle with Axel and Now everything screams, A siren of the Phrenes, I scream and scream And all the more my foot twitches, which is A sign that the stomp is MINE! MINE, not the Sublime’s, or some other klein spineless swine in brine’s, I see the blood stained hue, remains of the lokki’s life Settle within its eyes. Free of remorse, I laugh. I laugh, and then I stomp. Blood. Blood everywhere. Stomp. It’s a crippled bloodbath of wing and beak, I stomp. It is dead. I laugh. Stomp. It’s a joke, it’s all a joke! I stomp. A killing joke. I stomp. And now I won’t ever stop. ","pageStyle":"centre","pageBackground":""}