{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"The Tale of Major Korean","poemAuthor":"Bushi","poemContent":"\u0000\u0005\u0000I once knew a man, a sellsword , traveller, wanderer,\u0001His name was Major Korean, and now is recounted his tale of woe;\u0001\u0001\u0002 It was summer of 1923, or whenever it was auf der große streets,\u0001 I recognised a shadow, that lurked in the corner,\u0001 Stacks of money, all but useless\u0001 But the person I saw, said his name was,\u0001 A \"Major Korean\".\u0001\u0001I heard nothing more, until the second great war;\u0001A rogue soldier, not a nazi in the war,\u0001Travelled to a land unknown, fought to save many lives\u0001Grasped only a sword, an iron carved sword,\u0001Stained with valour, heart of woe.\u0001The warrior who fought for no country, only to save the others\u0001Named Major \"Korean\"\u0001\u0001Then I saw, at the door of the gates by the court,\u0001Tried for crimes, against the law, sat Major Korean,\u0001Crimes that were not crimes, such as speaking against a dictatorship.\u0001One of the few people I knew, was Major Korean, who was an\u0001Anti-racist.\u0001\u0001 But where is he now, what land does he lie,\u0001 A slayer, what became of the man, known as\u0001 Major Korean?\u0001\u0001This fellow, who was not even Korean, went under that alibi,\u0001For what, to protect which truths? Hide a life of honour?\u0001That person who defeated die Leute, tried end racism,\u0001His fate unknown, Major Korean, the Anti-Racist.\u0001\u0001T'was a dark day, when I realised, he had vanished,\u0001Off the face of the Earth.\u0001Die Geselschaft, a great enemy, back-stabbed that warrior\u0001What cave, creek or crevice did he hide, branded as a\u0001Threat to society?\u0001\u0001 I grasped a sword and trained, under the waterfall in the\u0001 Dead of the night, stealing my heart to be full of resolve,\u0001 To act out justice, restore that myth's honour.\u0001 The Mythical Major Korean.\u0001\u0001In those old days, when Stresemann reigned,\u0001How we'd all think,\u0001I have Weimar, my republic,\u0001How I'd want the Kaiser to be King!\u0001But now, it seems, we were wrong...\u0001The old days, age of slayers are now far gone.\u0001Hoonter, Reece, Noct, Major Korean, Speedwagon, Zekiahepic, Barir\u0001Those times, am besten Zeit\u0001Die Zukunft war nicht zu toll...\u0001\u0001But the tale does not end, no- not the take of Major Korean,\u0001Borne in 1066, borne of blood, brother in battle to the slayers,\u0001The un-racist könig.\u0001War is coming,a great plight, so, he took up th' mantle\u0001One last time.\u0001\u0001A final clash of steel, iron against iron,\u0001Last march of the catgirl slayers, before stepping into new dawn...\u0001Major Korean fought valiantly, but comrade after comrade fell,\u0001Bloodshed blood lets more mo'r blood\u0001And the ground bleeds red,\u0001It was then when he said, as the dawn of the next day set;\u0001Tears in his eyes, tired, could not fight anymore,\u0001\u0001I am sorry, Bushi, Noct, Martin Ligations, Swexys, Gundalf,\u0001Barir, Zekiahepic, Speedwagon, Samurai of the Spear, Dark Juice,\u0001Juloo, Delta. Solaire, Solar System Man, Reece and all fellow\u0001Other Slayer;\u0001\u0001 In order, to defeat this foe, and restore this honour...\u0001 I must become racism...\u0001 It must be done, thank you everyone...\u0001 This truly was an adventure, wasn't it?\u0001\u0001Then with one final attack, a desperate last resort, a desperate last stand.\u0001Major Korean unleashed his last attack, his final strike...\u0001All the enemies were slain, at the cost of Major Korean's sacrifice,\u0001With a final smile, he faded away, finally at peace, at his end.\u0001\u0001 \u0000\u0005\u0000This was the tale of Major Korean.\u0002\u0001\u0001","pageStyle":"poem-centre-wide","pageBackground":""}