{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"The Burial of Herr Fischer VI","poemAuthor":"Zekiah","poemContent":"Die Gesundheit hath toll,<br>\nAs the bloody bell strikes 9,<br>\nIt's a systematic tall, evenly spaced,<br>\nEach ring, marking th' upcoming hour of death,<br>\n\"Here lies Herr Fischer VI\"<br>\nWhat a man you are,<br>\n<br>\nStratified crowds gather, people clumping,<br>\nBy matter of thought, how to make it appear,<br>\nTo be, fair, but of bias,<br>\nRandomness creates a chaos,<br>\nEntropy crackles in the air...<br>\n<br>\nAgain the bloody bell tolls, now it is midnight.<br>\nMitternacht, the dead cry,<br>\nAs the city turns silent, it's empty cities weep silently,<br>\nAt this newfound threat,<br>\nAll lies silent, a part from the forest path,<br>\nThat leads into that dense undergrowth,<br>\n<br>\nFew words remained in these lands,<br>\nThe mines had long fell silent, emitting a dull bloody glow.<br>\nA crimson sky revealed itself overhead, only those of the<br>\nForest dared walk, among those twigs, red in hue,<br>\nBones and skulls of dead beasts,<br>\n<br>\nBut back at the capital, as again the dock whirs,<br>\nThe streets awaken in fear, met by the blighted hearse,<br>\nThrough interlocking valleys of architecture, menaced in design,<br>\nAnd through the bloody views of the streets,<br>\nAtop that carnage was a man, clad in feather,<br>\nDeathly plague-doctor<br>\nAnd he said to me:<br>\n<i><br>\n\"It's a descendant of the late lineage of Fischer,<br>\nThe infamous family, yet I scorn my kind, and<br>\nWeep for the students at the academy.<br>\nI storm them all, sane my liege, who I bear,<br>\nFrom the merciless upper-course down to the gentle but deep,<br>\nLands of the low, I have carried this hearse,<br>\nA coffin bearer, for seven days yet,<br>\nMy journey plotted in the bag of blood running up my spine,<br>\nContinuous was the toil, yet the event of this day,<br>\nIf I may say so discretely,<br>\nIt be a terrible day für die Geselschaft,<br>\nFor now will I bury Herr Fischer VI,<br>\nThe only honourable of his line, though bred from menaces,<br>\nHe fought to free the scholars of Tibbet from their unending curse,<br>\n</i>Now again, I recount, as this bloody moon low-lies,<br>\nI am a bearer of a curse.<br>\nThe curse to think of the crimes of the Fischers, evermore,<br>\nDespite this fellow, blighted by the plague,<br>\nAs I, indeed am one infected.<br>\nNow nam'd the doctor of physique,<br>\nA plague doctor, who wanders these harmed streets,<br>\nNow peace, I say to you, and I bid you well\".<br>\n<br>\nThe doctor was ne'er seen again,<br>\nAs the dawn approached.<br>\nAnother day, another folk.<br>\nThis was the tale of Herr Fischer VI,<br>\nIn this torn, where he was carried, already dead<br>\nThis torn, pained in it's bloody coat.<br>\n<br>","pageStyle":"centre","pageBackground":""}