{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"The Burial of Herr Fischer VI","poemAuthor":"Zekiah","poemContent":"Die Gesundheit hath toll,\u0001As the bloody bell strikes 9,\u0001It's a systematic tall, evenly spaced,\u0001Each ring, marking th' upcoming hour of death,\u0001\"Here lies Herr Fischer VI\"\u0001What a man you are,\u0001\u0001Stratified crowds gather, people clumping,\u0001By matter of thought, how to make it appear,\u0001To be, fair, but of bias,\u0001Randomness creates a chaos,\u0001Entropy crackles in the air...\u0001\u0001Again the bloody bell tolls, now it is midnight.\u0001Mitternacht, the dead cry,\u0001As the city turns silent, it's empty cities weep silently,\u0001At this newfound threat,\u0001All lies silent, a part from the forest path,\u0001That leads into that dense undergrowth,\u0001\u0001Few words remained in these lands,\u0001The mines had long fell silent, emitting a dull bloody glow.\u0001A crimson sky revealed itself overhead, only those of the\u0001Forest dared walk, among those twigs, red in hue,\u0001Bones and skulls of dead beasts,\u0001\u0001But back at the capital, as again the dock whirs,\u0001The streets awaken in fear, met by the blighted hearse,\u0001Through interlocking valleys of architecture, menaced in design,\u0001And through the bloody views of the streets,\u0001Atop that carnage was a man, clad in feather,\u0001Deathly plague-doctor\u0001And he said to me:\u0001\u0000\u0005\u0000\u0001\"It's a descendant of the late lineage of Fischer,\u0001The infamous family, yet I scorn my kind, and\u0001Weep for the students at the academy.\u0001I storm them all, sane my liege, who I bear,\u0001From the merciless upper-course down to the gentle but deep,\u0001Lands of the low, I have carried this hearse,\u0001A coffin bearer, for seven days yet,\u0001My journey plotted in the bag of blood running up my spine,\u0001Continuous was the toil, yet the event of this day,\u0001If I may say so discretely,\u0001It be a terrible day für die Geselschaft,\u0001For now will I bury Herr Fischer VI,\u0001The only honourable of his line, though bred from menaces,\u0001He fought to free the scholars of Tibbet from their unending curse,\u0001\u0002Now again, I recount, as this bloody moon low-lies,\u0001I am a bearer of a curse.\u0001The curse to think of the crimes of the Fischers, evermore,\u0001Despite this fellow, blighted by the plague,\u0001As I, indeed am one infected.\u0001Now nam'd the doctor of physique,\u0001A plague doctor, who wanders these harmed streets,\u0001Now peace, I say to you, and I bid you well\".\u0001\u0001The doctor was ne'er seen again,\u0001As the dawn approached.\u0001Another day, another folk.\u0001This was the tale of Herr Fischer VI,\u0001In this torn, where he was carried, already dead\u0001This torn, pained in it's bloody coat.\u0001\u0001","pageStyle":"centre","pageBackground":""}