{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"The Tale of Major Korean","poemAuthor":"Bushi","poemContent":"<i>I once knew a man, a sellsword , traveller, wanderer,<br>\nHis name was Major Korean, and now is recounted his tale of woe;<br>\n<br>\n</i>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; It was summer of 1923, or whenever it was auf der große streets,<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I recognised a shadow, that lurked in the corner,<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Stacks of money, all but useless<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; But the person I saw, said his name was,<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A \"Major Korean\".<br>\n<br>\nI heard nothing more, until the second great war;<br>\nA rogue soldier, not a nazi in the war,<br>\nTravelled to a land unknown, fought to save many lives<br>\nGrasped only a sword, an iron carved sword,<br>\nStained with valour, heart of woe.<br>\nThe warrior who fought for no country, only to save the others<br>\nNamed Major \"Korean\"<br>\n<br>\nThen I saw, at the door of the gates by the court,<br>\nTried for crimes, against the law, sat Major Korean,<br>\nCrimes that were not crimes, such as speaking against a dictatorship.<br>\nOne of the few people I knew, was Major Korean, who was an<br>\nAnti-racist.<br>\n<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; But where is he now, what land does he lie,<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; A slayer, what became of the man, known as<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Major Korean?<br>\n<br>\nThis fellow, who was not even Korean, went under that alibi,<br>\nFor what, to protect which truths? Hide a life of honour?<br>\nThat person who defeated die Leute, tried end racism,<br>\nHis fate unknown, Major Korean, the Anti-Racist.<br>\n<br>\nT'was a dark day, when I realised, he had vanished,<br>\nOff the face of the Earth.<br>\nDie Geselschaft, a great enemy, back-stabbed that warrior<br>\nWhat cave, creek or crevice did he hide, branded as a<br>\nThreat to society?<br>\n<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I grasped a sword and trained, under the waterfall in the<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Dead of the night, stealing my heart to be full of resolve,<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; To act out justice, restore that myth's honour.<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The Mythical Major Korean.<br>\n<br>\nIn those old days, when Stresemann reigned,<br>\nHow we'd all think,<br>\nI have Weimar, my republic,<br>\nHow I'd want the Kaiser to be King!<br>\nBut now, it seems, we were wrong...<br>\nThe old days, age of slayers are now far gone.<br>\nHoonter, Reece, Noct, Major Korean, Speedwagon, Zekiahepic, Barir<br>\nThose times, am besten Zeit<br>\nDie Zukunft war nicht zu toll...<br>\n<br>\nBut the tale does not end, no- not the take of Major Korean,<br>\nBorne in 1066, borne of blood, brother in battle to the slayers,<br>\nThe un-racist könig.<br>\nWar is coming,a great plight, so, he took up th' mantle<br>\nOne last time.<br>\n<br>\nA final clash of steel, iron against iron,<br>\nLast march of the catgirl slayers, before stepping into new dawn...<br>\nMajor Korean fought valiantly, but comrade after comrade fell,<br>\nBloodshed blood lets more mo'r blood<br>\nAnd the ground bleeds red,<br>\nIt was then when he said, as the dawn of the next day set;<br>\nTears in his eyes, tired, could not fight anymore,<br>\n<br>\nI am sorry, Bushi, Noct, Martin Ligations, Swexys, Gundalf,<br>\nBarir, Zekiahepic, Speedwagon, Samurai of the Spear, Dark Juice,<br>\nJuloo, Delta. Solaire, Solar System Man, Reece and all fellow<br>\nOther Slayer;<br>\n<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In order, to defeat this foe, and restore this honour...<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I must become racism...<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; It must be done, thank you everyone...<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This truly was an adventure, wasn't it?<br>\n<br>\nThen with one final attack, a desperate last resort, a desperate last stand.<br>\nMajor Korean unleashed his last attack, his final strike...<br>\nAll the enemies were slain, at the cost of Major Korean's sacrifice,<br>\nWith a final smile, he faded away, finally at peace, at his end.<br>\n<br>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <i>This was the tale of Major Korean.</i><br>\n<br>","pageStyle":"centre-wide","pageBackground":""}