{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"Composed upon Mount Isso, March 22, 2022","poemAuthor":"Angelos","poemContent":"One spring lunchtime (led by her),\u0001They found a shiny basketball, frozen on the road,\u0001Between the grand fields, it's usual home.\u0001\u0001The wizened earth has never troubled us;\u0001No lions chase, or hidden snakes to miss,\u0001Or teachers to comfort them, when the youngsters take the piss;\u0001Two trunk-less goalposts, and a few dotted trees just stand.\u0001\u0001\u0001But this basketball was no ordinary one.\u0001Small gemstones glittered between it's plastic skin,\u0001Melting in that girl's eyes.\u0001\u0001She was an A* student and wondered as she wandered\u0001How a sphere can stand still, on the slope of a hill.\u0001Proud of her skill, she knew she could find it,\u0001Those beams of light were nothing but photons.\u0001\u0001A God given gift; perhaps a Trojan horse?\u0001This was magic, but it couldn't; be vane.\u0001She crouched right down above this mystical object,\u0001And checked her under-eye under he mirror,\u0001But she was sane.\u0001\u0001As she rose from that stroke of shock,\u0001She raises her foot right up,\u0001straight into a perfect right angle to her upright stance,\u0001And as if with voluntary human instinct,\u0001Booted the magic ball; \u0000\u0005\u0000turned savage\u0002.\u0001\u0001Still in the stature of her shape, grew the dunnest stinging pain.\u0001The very basketball, spat out it's grey contents.\u0001They were bombarded by a hollow ball.\u0001\u0001They huffed and puffed again,\u0001For so it seemed, with struggle of her own,\u0001Measuring motion like a living thing,\u0001To haul a crappy plastic ball in the bin!\u0001\u0001Back to the covert of sixth-\u0000\u0007\u0000\u0002form centre,\u0001There hung a darkness, call it solitude.\u0001No familiar shapes remained;\u0001No pleasant images of trees or green fields;\u0001Four year 11s running away giggling,\u0001Day by day, a plague to her dreams.\u0001\u0001","pageStyle":"poem-centre","pageBackground":""}