{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"Composed upon Mount Isso, March 22, 2022","poemAuthor":"Angelos","poemContent":"One spring lunchtime (led by her),<br>\nThey found a shiny basketball, frozen on the road,<br>\nBetween the grand fields, it's usual home.<br>\n<br>\nThe wizened earth has never troubled us;<br>\nNo lions chase, or hidden snakes to miss,<br>\nOr teachers to comfort them, when the youngsters take the piss;<br>\nTwo trunk-less goalposts, and a few dotted trees just stand.<br>\n<br>\n<br>\nBut this basketball was no ordinary one.<br>\nSmall gemstones glittered between it's plastic skin,<br>\nMelting in that girl's eyes.<br>\n<br>\nShe was an A* student and wondered as she wandered<br>\nHow a sphere can stand still, on the slope of a hill.<br>\nProud of her skill, she knew she could find it,<br>\nThose beams of light were nothing but photons.<br>\n<br>\nA God given gift; perhaps a Trojan horse?<br>\nThis was magic, but it couldn't; be vane.<br>\nShe crouched right down above this mystical object,<br>\nAnd checked her under-eye under he mirror,<br>\nBut she was sane.<br>\n<br>\nAs she rose from that stroke of shock,<br>\nShe raises her foot right up,<br>\nstraight into a perfect right angle to her upright stance,<br>\nAnd as if with voluntary human instinct,<br>\nBooted the magic ball; <i>turned savage</i>.<br>\n<br>\nStill in the stature of her shape, grew the dunnest stinging pain.<br>\nThe very basketball, spat out it's grey contents.<br>\nThey were bombarded by a hollow ball.<br>\n<br>\nThey huffed and puffed again,<br>\nFor so it seemed, with struggle of her own,<br>\nMeasuring motion like a living thing,<br>\nTo haul a crappy plastic ball in the bin!<br>\n<br>\nBack to the covert of sixth-<sup></sup>form centre,<br>\nThere hung a darkness, call it solitude.<br>\nNo familiar shapes remained;<br>\nNo pleasant images of trees or green fields;<br>\nFour year 11s running away giggling,<br>\nDay by day, a plague to her dreams.<br>\n<br>","pageStyle":"e","pageBackground":""}