{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"Cupcake Bomb","poemAuthor":"Zekiah","poemContent":"🇺🇦 Ukraine: Hey guys, could we get some reinforcements?\u0001\u0001🇺🇸 Second Officer: Look sir, we can't, it's too dangerou-\u0001🇺🇸 Captain: Unleash it.\u0001\u0001Helicopters blast the hair off the poles,\u0001as they speed over the border of Ukraine,\u0001Rotors at MAX rpm, swerving from left\u0001to right, as they carry a heavy load below.\u0001\u0001Fastened by carabiners and ropes of steel,\u0001Chinhooks, apaches, jets and more,\u0001guiding the weapon of colossal destruction to\u0001the killing place.\u0001\u0001In Kyiv now, and as the red sun starts to set,\u0001beauty for a moment, as each rope falls slack,\u0001a huge shadow casting over each apartment in darkness,\u0001the children hidden in the bunkers draw close to the cracks, in the walls,\u0001\u0001to observe as the colossal giant, in wonder\u0001slowly descends with the force of a thousand nukes,\u0001an eir of insatiable tranquility for the few moments before impact, as the \u0001orange sunset light falls behind...\u0001\u0001Then a shock wave, throwing them under rubble,\u0001as buildings collapse in the feverish heat of the impact, uprooting every tank and gunner,\u0001a colossal divot forms, ripping and devouring the flesh of the earth,\u0001like EDP taking a bite into daughter nature's cupcake, after luring it into the deceitful wake of his destruction,\u0001and exploding in the centre of the town.\u0001\u0001🇺🇸 Second Officer: I'lll be the first to say that I was wrong, good work, Cap'n.\u0001\u0001Hiroshima, Nagasaki\u0001\u0001🇺🇸 Captain: I mean, we do God's work upholding democracy.\u0001\u0001Little of Ukraine yet remains.\u0001Same case with Afghanistan, Syria and that other place.\u0001\u0001🇺🇸 Second Officer: Wait, so who were we fighting again this time, the Russians?\u0001\u0001Ready to deploy the EDP again.\u0001\u0001","pageStyle":"poem-centre-wide","pageBackground":""}