{"summary":"","tags":"","cWarning":false,"cWarningAdditions":"","poemName":"Cupcake Bomb","poemAuthor":"Zekiah","poemContent":"🇺🇦 Ukraine: Hey guys, could we get some reinforcements?<br>\n<br>\n🇺🇸 Second Officer: Look sir, we can't, it's too dangerou-<br>\n🇺🇸 Captain: Unleash it.<br>\n<br>\nHelicopters blast the hair off the poles,<br>\nas they speed over the border of Ukraine,<br>\nRotors at MAX rpm, swerving from left<br>\nto right, as they carry a heavy load below.<br>\n<br>\nFastened by carabiners and ropes of steel,<br>\nChinhooks, apaches, jets and more,<br>\nguiding the weapon of colossal destruction to<br>\nthe killing place.<br>\n<br>\nIn Kyiv now, and as the red sun starts to set,<br>\nbeauty for a moment, as each rope falls slack,<br>\na huge shadow casting over each apartment in darkness,<br>\nthe children hidden in the bunkers draw close to the cracks, in the walls,<br>\n<br>\nto observe as the colossal giant, in wonder<br>\nslowly descends with the force of a thousand nukes,<br>\nan eir of insatiable tranquility for the few moments before impact, as the <br>\norange sunset light falls behind...<br>\n<br>\nThen a shock wave, throwing them under rubble,<br>\nas buildings collapse in the feverish heat of the impact, uprooting every tank and gunner,<br>\na colossal divot forms, ripping and devouring the flesh of the earth,<br>\nlike EDP taking a bite into daughter nature's cupcake, after luring it into the deceitful wake of his destruction,<br>\nand exploding in the centre of the town.<br>\n<br>\n🇺🇸 Second Officer: I'lll be the first to say that I was wrong, good work, Cap'n.<br>\n<br>\nHiroshima, Nagasaki<br>\n<br>\n🇺🇸 Captain: I mean, we do God's work upholding democracy.<br>\n<br>\nLittle of Ukraine yet remains.<br>\nSame case with Afghanistan, Syria and that other place.<br>\n<br>\n🇺🇸 Second Officer: Wait, so who were we fighting again this time, the Russians?<br>\n<br>\nReady to deploy the EDP again.<br>\n<br>","pageStyle":"centre-wide","pageBackground":""}