{"summary":"","tags":"","cWarning":true,"cWarningAdditions":"","poemName":"We live in a dictatorship","poemAuthor":"Angelos","poemContent":"So this last day of school,<br>\nWhen you’ve aced your last exam,<br>\nForget those lies and rip off your tie,<br>\nTear your school trousers in a pair of ripped jeans,<br>\nPut your blazer under the guillotine,<br>\nTill it’s hanging strips of blue and red.<br>\nFling your tie against the playground fence,<br>\nAnd scribble on the fabric, in black whiteboard pen,<br>\nHark the Herald, Hail the woods!<br>\nGlory to the ‘‘Book of fame’’<br>\n- Insert a quote of dignity and inspiration<br>\n- Shut up! You Year Heads of abomination<br>\nThat’s my quote for you eternally doomed,<br>\nDon’t like it? I’m fine in the Withdrawal Room.<br>\nAnd meet me up with Mr Statin,<br>\nTo teach him the fate of OzyAndy.<br>\n‘‘Upload a yearbook photo’’<br>\nNO is my moto<br>\n<br>\nFor Google Classroom’s chock full of lies,<br>\nWaffle, waffle in physics and biology,<br>\nMice eat cats and cats eat mice,<br>\n\"See me at lunch.\" You forgot to circle that anomaly.<br>\nRespiration is just combustion of glucose,<br>\nAnd photosynthesis – just CO2 in a test tube!<br>\nDon’t bother writing a single bit more,<br>\nSee I told you! One out of four!<br>\nYour sketchbook's too abstract! Your portrait’s too pale,<br>\nUnfortunately, It will all have to be a total fail,<br>\nThe sun looks too mellow,<br>\nYou need more yellow.<br>\nDoes it have to glow?<br>\nSkitzgerald said so!<br>\nEverything is watched,<br>\nDid I run? Did I walk?<br>\nAm I sweating or wet, or smell of ammonia?<br>\n- Careful, you’ll catch bronchitis and pneumonia!’’<br>\n- Fuck off you Spazpole and Martin, your boyfriend!<br>\nFor none of you are my Mum or Dad.<br>\nIf you make keeping fit more so of a pain,<br>\nWe will end up obese and lame. <em><sub>(like you)</sub></em><br>\n<br>\nBesides:<br>\nThose five aside fucking footie fanatics,<br>\nFor each touch, each goal between the coats and bags – just pedantic,<br>\nYou accuse me of only my glistening sweat,<br>\nBut the footie players are the ones, who their seats do wet!<br>\nDem never asked me if this made me puke,<br>\nBut my mere morning jog, they rebuke.<br>\nDemocracy is DEAD. Bojo sealed his approval,<br>\nHis head of a mop and his eyes of ice,<br>\nOn parliament did he STOMP twice.<br>\nSHN – Stay home now! Protect our fantastic NHS!<br>\nIn your fantasy it lies, you idiot, you clown-punk.<br>\nSo resign right now and clear your muck,<br>\nAbout your regulations, we don’t give a fuck.<br>\nOur life revolves around one CT,<br>\nOh no invalid! Just the T, no C!<br>\nLies, lies, lies, these are all LIES,<br>\nBut we believe them<br>\nWhy? For the benefit and satisfaction,<br>\nA pointless endeavor.<br>\nOf a minuscule fraction! <br>\n<br>","pageStyle":"e","pageBackground":""}